# ALL-B12_deviationlistPGM.R
# 作成者：kaoru torii
# 作成日：2016/06/15
# ver.2.0

#########################
#wdの変更
setwd("../programs")

#必要項目の抽出

F1<- fs1[,c("作成日","症例登録番号","シート名")]
F3<- fs3[,c("作成日","症例登録番号","シート名")]
F4<- fs4[,c("作成日","症例登録番号","シート名")]
F5<- fs5[,c("作成日","症例登録番号","シート名")]
F6<- fs6[,c("作成日","症例登録番号","シート名")]
F7<- fs7[,c("作成日","症例登録番号","シート名")]
F8<- fs8[,c("作成日","症例登録番号","シート名")]
F9<- fs9[,c("作成日","症例登録番号","シート名")]
F10<- fs10[,c("作成日","症例登録番号","シート名")]
F11<- fs11[,c("作成日","症例登録番号","シート名")]
F12<- fs12[,c("作成日","症例登録番号","シート名")]
F13<- fs13[,c("作成日","症例登録番号","シート名")]
F14<- fs14[,c("作成日","症例登録番号","シート名")]
F15<- fs15[,c("作成日","症例登録番号","シート名")]
F16<- fs16[,c("作成日","症例登録番号","シート名")]
F17<- fs17[,c("作成日","症例登録番号","シート名")]
F18<- fs18[,c("作成日","症例登録番号","シート名")]
F19<- fs19[,c("作成日","症例登録番号","シート名")]
F20<- fs20[,c("作成日","症例登録番号","シート名")]
F21<- fs21[,c("作成日","症例登録番号","シート名")]
F22<- fs22[,c("作成日","症例登録番号","シート名")]
F23<- fs23[,c("作成日","症例登録番号","シート名")]
F24<- fs24[,c("作成日","症例登録番号","シート名")]
F25<- fs25[,c("作成日","症例登録番号","シート名")]
F26<- fs26[,c("作成日","症例登録番号","シート名")]
F27<- fs27[,c("作成日","症例登録番号","シート名")]
F28<- fs28[,c("作成日","症例登録番号","シート名")]
F29<- fs29[,c("作成日","症例登録番号","シート名")]
F30<- fs30[,c("作成日","症例登録番号","シート名")]
F31<- fs31[,c("作成日","症例登録番号","シート名")]
F32<- fs32[,c("作成日","症例登録番号","シート名")]
F33<- fs33[,c("作成日","症例登録番号","シート名")]
F34<- fs34[,c("作成日","症例登録番号","シート名")]
F35<- fs35[,c("作成日","症例登録番号","シート名")]
F36<- fs36[,c("作成日","症例登録番号","シート名")]
F38<- fs38[,c("作成日","症例登録番号","シート名")]
F39<- fs39[,c("作成日","症例登録番号","シート名")]
F42<- fs42[,c("作成日","症例登録番号","シート名")]
F43<- fs43[,c("作成日","症例登録番号","シート名")]
Ini<- ini[,c("作成日","症例登録番号","シート名")]
Risk1 <- rs1[,c("作成日","症例登録番号","シート名")]
Risk2 <- rs2[,c("作成日","症例登録番号","シート名")]
Risk3 <- rs3[,c("作成日","症例登録番号","シート名")]

#逸脱一覧のリストに作成日をマージさせるためフローシートのファイルを結合し、作成日リストを作成する(縦結合)
creation_date<- rbind(F1,F3,F4,F5,F6,F7,F8,F9,F10,F11,F12,F13,F14,F15,F16,
                      F17,F18,F19,F20,F21,F22,F23,F24,F25,F26,F27,F28,F29,
                      F30,F31,F32,F33,F34,F35,F36,F38,F39,F42,F43,Ini,Risk1,Risk2,Risk3)

#変数名の変更(変数名の頭に「b_」をつける)
colnames(creation_date)<- paste0("b_",colnames(creation_date))

#dvシート(逸脱一覧csv)grade4およびgrade5を削除(a1_入力値.表示データ.項目内のgradeが逸脱となっている行を削除する)
itudatu_ae4 <- grep("-4",dv$入力値.表示データ.)
itudatu_nae4<- dv[-c(itudatu_ae4[1:length(itudatu_ae4)]),]

itudatu_ae<- grep("-5",itudatu_nae4$入力値.表示データ.)
itudatu_nae<- itudatu_nae4[-c(itudatu_ae[1:length(itudatu_ae)]),]

#施設科名を分ける
colnames(itudatu_nae)
itudatu_nae$施設名<- sub("-.*","",itudatu_nae$施設名科名)

#変数名の変更(変数名の頭に「 」をつける)
colnames(itudatu_nae)<- paste0("",colnames(itudatu_nae))

#必要な項目の抽出
colnames(itudatu_nae)
itudatu<- itudatu_nae[,c("症例番号","順序付きフローシート順序","施設名","シート名","フィールドラベル","入力値.表示データ.")]

#リスクシートのマージ
risk3<- merge(rs1,rs2,by=c("症例登録番号"),all.x=T)

#症例番号、暫定リスク、確定リスクの抽出
risk<- risk3[,c("症例登録番号","暫定リスク判定結果","確定リスク判定結果")]

#中止届の必要項目の抽出
cancel<- cs1[,c("症例登録番号","中止時期.コース名.","治療終了.中止.理由","中止時期.day.week.","中止時期.日数.週数.")]

#マージをする(itudatu,creation_date,risk,cancelの4ファイル)※キーはitudatuファイルの「症例番号」
colnames(itudatu)
colnames(creation_date)

itudatu_a<- merge(itudatu,creation_date,by.x=c("症例番号","シート名"),by.y=c("b_症例登録番号","b_シート名"),all.x=T)
itudatu_b<- merge(itudatu_a,risk,by.x="症例番号",by.y="症例登録番号",all.x=T)
itudatu_c<- merge(itudatu_b,cancel,by.x="症例番号",by.y="症例登録番号",all.x=T)

#フローシート名の「フローシート：」を外す
colnames(itudatu_c)
study_<- sub("フローシート："," ",itudatu_c$シート名)
itudatulist3<- data.frame(itudatu_c,study_)

#並び替え
colnames(itudatulist3)
itudatulist2<- itudatulist3[,c("b_作成日","順序付きフローシート順序","症例番号","施設名","暫定リスク判定結果", "確定リスク判定結果",
                               "シート名","フィールドラベル","入力値.表示データ.","中止時期.コース名.","治療終了.中止.理由","中止時期.day.week.","中止時期.日数.週数.")]

#必要項目の抽出
itudatulist1<- itudatulist3[,c("b_作成日","順序付きフローシート順序","症例番号","施設名","暫定リスク判定結果","確定リスク判定結果","study_","フィールドラベル","入力値.表示データ."
                               ,"中止時期.コース名.","治療終了.中止.理由","中止時期.day.week.","中止時期.日数.週数.")]    

#名前の変更
names(itudatulist1)[3:9]<- c("ALL-B12 No.","施設名","暫定リスク","確定リスク","治療コース","項目","内容") 

#ソートする
itudatulist<- order(itudatulist1$治療コース)
itudatulist<- (itudatulist1[itudatulist,])
itudatulist

#csvファイルへの書き出し
setwd("../output")
write.csv(itudatulist,PathOutputdv,row.names=FALSE)

